Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/dmac.h
/* -------- DMAC_BTCNT : (DMAC Offset: 0x02) (R/W 16) Block Transfer Count -------- */
#define DMAC_BTCNT_RESETVALUE                 _UINT16_(0x00)                                       /*  (DMAC_BTCNT) Block Transfer Count  Reset Value */

#define DMAC_BTCNT_BTCNT_Pos                  _UINT16_(0)                                          /* (DMAC_BTCNT) Block Transfer Count Position */
#define DMAC_BTCNT_BTCNT_Msk                  (_UINT16_(0xFFFF) << DMAC_BTCNT_BTCNT_Pos)           /* (DMAC_BTCNT) Block Transfer Count Mask */
#define DMAC_BTCNT_BTCNT(value)               (DMAC_BTCNT_BTCNT_Msk & (_UINT16_(value) << DMAC_BTCNT_BTCNT_Pos)) /* Assignment of value for BTCNT in the DMAC_BTCNT register */
#define DMAC_BTCNT_Msk                        _UINT16_(0xFFFF)                                     /* (DMAC_BTCNT) Register Mask  */


/* -------- DMAC_SRCADDR : (DMAC Offset: 0x04) (R/W 32) Block Transfer Source Address -------- */
#define DMAC_SRCADDR_RESETVALUE               _UINT32_(0x00)                                       /*  (DMAC_SRCADDR) Block Transfer Source Address  Reset Value */

#define DMAC_SRCADDR_SRCADDR_Pos              _UINT32_(0)                                          /* (DMAC_SRCADDR) Transfer Source Address Position */
#define DMAC_SRCADDR_SRCADDR_Msk              (_UINT32_(0xFFFFFFFF) << DMAC_SRCADDR_SRCADDR_Pos)   /* (DMAC_SRCADDR) Transfer Source Address Mask */
#define DMAC_SRCADDR_SRCADDR(value)           (DMAC_SRCADDR_SRCADDR_Msk & (_UINT32_(value) << DMAC_SRCADDR_SRCADDR_Pos)) /* Assignment of value for SRCADDR in the DMAC_SRCADDR register */
#define DMAC_SRCADDR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (DMAC_SRCADDR) Register Mask  */


/* -------- DMAC_DSTADDR : (DMAC Offset: 0x08) (R/W 32) Block Transfer Destination Address -------- */
#define DMAC_DSTADDR_DSTADDR_Pos              _UINT32_(0)                                          /* (DMAC_DSTADDR) Transfer Destination Address Position */
#define DMAC_DSTADDR_DSTADDR_Msk              (_UINT32_(0xFFFFFFFF) << DMAC_DSTADDR_DSTADDR_Pos)   /* (DMAC_DSTADDR) Transfer Destination Address Mask */
#define DMAC_DSTADDR_DSTADDR(value)           (DMAC_DSTADDR_DSTADDR_Msk & (_UINT32_(value) << DMAC_DSTADDR_DSTADDR_Pos)) /* Assignment of value for DSTADDR in the DMAC_DSTADDR register */
#define DMAC_DSTADDR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (DMAC_DSTADDR) Register Mask  */

/* CRC mode */
#define DMAC_DSTADDR_CRC_CHKINIT_Pos          _UINT32_(0)                                          /* (DMAC_DSTADDR) CRC Checksum Initial Value Position */
#define DMAC_DSTADDR_CRC_CHKINIT_Msk          (_UINT32_(0xFFFFFFFF) << DMAC_DSTADDR_CRC_CHKINIT_Pos) /* (DMAC_DSTADDR) CRC Checksum Initial Value Mask */
#define DMAC_DSTADDR_CRC_CHKINIT(value)       (DMAC_DSTADDR_CRC_CHKINIT_Msk & (_UINT32_(value) << DMAC_DSTADDR_CRC_CHKINIT_Pos))
#define DMAC_DSTADDR_CRC_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (DMAC_DSTADDR_CRC) Register Mask  */


/* -------- DMAC_DESCADDR : (DMAC Offset: 0x0C) (R/W 32) Next Descriptor Address -------- */
#define DMAC_DESCADDR_DESCADDR_Pos            _UINT32_(0)                                          /* (DMAC_DESCADDR) Next Descriptor Address Position */
#define DMAC_DESCADDR_DESCADDR_Msk            (_UINT32_(0xFFFFFFFF) << DMAC_DESCADDR_DESCADDR_Pos) /* (DMAC_DESCADDR) Next Descriptor Address Mask */
#define DMAC_DESCADDR_DESCADDR(value)         (DMAC_DESCADDR_DESCADDR_Msk & (_UINT32_(value) << DMAC_DESCADDR_DESCADDR_Pos)) /* Assignment of value for DESCADDR in the DMAC_DESCADDR register */
#define DMAC_DESCADDR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (DMAC_DESCADDR) Register Mask  */


/* -------- DMAC_CHCTRLA : (DMAC Offset: 0x00) (R/W 32) Channel n Control A -------- */
#define DMAC_CHCTRLA_RESETVALUE               _UINT32_(0x00)                                       /*  (DMAC_CHCTRLA) Channel n Control A  Reset Value */

#define DMAC_CHCTRLA_SWRST_Pos                _UINT32_(0)                                          /* (DMAC_CHCTRLA) Channel Software Reset Position */
#define DMAC_CHCTRLA_SWRST_Msk                (_UINT32_(0x1) << DMAC_CHCTRLA_SWRST_Pos)            /* (DMAC_CHCTRLA) Channel Software Reset Mask */
#define DMAC_CHCTRLA_SWRST(value)             (DMAC_CHCTRLA_SWRST_Msk & (_UINT32_(value) << DMAC_CHCTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the DMAC_CHCTRLA register */
#define DMAC_CHCTRLA_ENABLE_Pos               _UINT32_(1)                                          /* (DMAC_CHCTRLA) Channel Enable Position */
#define DMAC_CHCTRLA_ENABLE_Msk               (_UINT32_(0x1) << DMAC_CHCTRLA_ENABLE_Pos)           /* (DMAC_CHCTRLA) Channel Enable Mask */
#define DMAC_CHCTRLA_ENABLE(value)            (DMAC_CHCTRLA_ENABLE_Msk & (_UINT32_(value) << DMAC_CHCTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the DMAC_CHCTRLA register */
#define DMAC_CHCTRLA_RUNSTDBY_Pos             _UINT32_(6)                                          /* (DMAC_CHCTRLA) Channel Run in Standby Position */
#define DMAC_CHCTRLA_RUNSTDBY_Msk             (_UINT32_(0x1) << DMAC_CHCTRLA_RUNSTDBY_Pos)         /* (DMAC_CHCTRLA) Channel Run in Standby Mask */
#define DMAC_CHCTRLA_RUNSTDBY(value)          (DMAC_CHCTRLA_RUNSTDBY_Msk & (_UINT32_(value) << DMAC_CHCTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the DMAC_CHCTRLA register */
#define DMAC_CHCTRLA_TRIGSRC_Pos              _UINT32_(8)                                          /* (DMAC_CHCTRLA) Trigger Source Position */
#define DMAC_CHCTRLA_TRIGSRC_Msk              (_UINT32_(0xFF) << DMAC_CHCTRLA_TRIGSRC_Pos)         /* (DMAC_CHCTRLA) Trigger Source Mask */
#define DMAC_CHCTRLA_TRIGSRC(value)           (DMAC_CHCTRLA_TRIGSRC_Msk & (_UINT32_(value) << DMAC_CHCTRLA_TRIGSRC_Pos)) /* Assignment of value for TRIGSRC in the DMAC_CHCTRLA register */
#define   DMAC_CHCTRLA_TRIGSRC_DISABLE_Val    _UINT32_(0x0)                                        /* (DMAC_CHCTRLA) Only software/event triggers  */
#define   DMAC_CHCTRLA_TRIGSRC_RTC_DMAC_ID_TIMESTAMP_Val _UINT32_(0x1)                                        /* (DMAC_CHCTRLA) Trigger source is RTC  */
#define   DMAC_CHCTRLA_TRIGSRC_DSU_DMAC_ID_DCC0_Val _UINT32_(0x2)                                        /* (DMAC_CHCTRLA) Trigger source is DSU DCC0  */
#define   DMAC_CHCTRLA_TRIGSRC_DSU_DMAC_ID_DCC1_Val _UINT32_(0x3)                                        /* (DMAC_CHCTRLA) Trigger source is DSU DCC1  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM0_DMAC_ID_RX_Val _UINT32_(0x4)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM0 RX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM0_DMAC_ID_TX_Val _UINT32_(0x5)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM0 TX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM1_DMAC_ID_RX_Val _UINT32_(0x6)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM1 RX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM1_DMAC_ID_TX_Val _UINT32_(0x7)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM1 TX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM2_DMAC_ID_RX_Val _UINT32_(0x8)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM2 RX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM2_DMAC_ID_TX_Val _UINT32_(0x9)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM2 TX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM3_DMAC_ID_RX_Val _UINT32_(0xA)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM3 RX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM3_DMAC_ID_TX_Val _UINT32_(0xB)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM3 TX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM4_DMAC_ID_RX_Val _UINT32_(0xC)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM4 RX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM4_DMAC_ID_TX_Val _UINT32_(0xD)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM4 TX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM5_DMAC_ID_RX_Val _UINT32_(0xE)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM5 RX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM5_DMAC_ID_TX_Val _UINT32_(0xF)                                        /* (DMAC_CHCTRLA) Trigger source is SERCOM5 TX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM6_DMAC_ID_RX_Val _UINT32_(0x10)                                       /* (DMAC_CHCTRLA) Trigger source is SERCOM6 RX  */
#define   DMAC_CHCTRLA_TRIGSRC_SERCOM6_DMAC_ID_TX_Val _UINT32_(0x11)                                       /* (DMAC_CHCTRLA) Trigger source is SERCOM6 TX  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_OVF_Val _UINT32_(0x12)                                       /* (DMAC_CHCTRLA) Trigger source is TCC0 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_0_Val _UINT32_(0x13)                                       /* (DMAC_CHCTRLA) Trigger source is TCC0 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_1_Val _UINT32_(0x14)                                       /* (DMAC_CHCTRLA) Trigger source is TCC0 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_2_Val _UINT32_(0x15)                                       /* (DMAC_CHCTRLA) Trigger source is TCC0 MC2  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_3_Val _UINT32_(0x16)                                       /* (DMAC_CHCTRLA) Trigger source is TCC0 MC3  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_4_Val _UINT32_(0x17)                                       /* (DMAC_CHCTRLA) Trigger source is TCC0 MC4  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_5_Val _UINT32_(0x18)                                       /* (DMAC_CHCTRLA) Trigger source is TCC0 MC5  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_OVF_Val _UINT32_(0x19)                                       /* (DMAC_CHCTRLA) Trigger source is TCC1 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_0_Val _UINT32_(0x1A)                                       /* (DMAC_CHCTRLA) Trigger source is TCC1 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_1_Val _UINT32_(0x1B)                                       /* (DMAC_CHCTRLA) Trigger source is TCC1 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_2_Val _UINT32_(0x1C)                                       /* (DMAC_CHCTRLA) Trigger source is TCC1 MC2  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_3_Val _UINT32_(0x1D)                                       /* (DMAC_CHCTRLA) Trigger source is TCC1 MC3  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_4_Val _UINT32_(0x1E)                                       /* (DMAC_CHCTRLA) Trigger source is TCC1 MC4  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_5_Val _UINT32_(0x1F)                                       /* (DMAC_CHCTRLA) Trigger source is TCC1 MC5  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_OVF_Val _UINT32_(0x20)                                       /* (DMAC_CHCTRLA) Trigger source is TCC2 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_MC_0_Val _UINT32_(0x21)                                       /* (DMAC_CHCTRLA) Trigger source is TCC2 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_MC_1_Val _UINT32_(0x22)                                       /* (DMAC_CHCTRLA) Trigger source is TCC2 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_OVF_Val _UINT32_(0x23)                                       /* (DMAC_CHCTRLA) Trigger source is TCO OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_MC_0_Val _UINT32_(0x24)                                       /* (DMAC_CHCTRLA) Trigger source is TC0 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_MC_1_Val _UINT32_(0x25)                                       /* (DMAC_CHCTRLA) Trigger source is TC0 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_OVF_Val _UINT32_(0x26)                                       /* (DMAC_CHCTRLA) Trigger source is TC1 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_MC_0_Val _UINT32_(0x27)                                       /* (DMAC_CHCTRLA) Trigger source is TC1 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_MC_1_Val _UINT32_(0x28)                                       /* (DMAC_CHCTRLA) Trigger source is TC1 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_OVF_Val _UINT32_(0x29)                                       /* (DMAC_CHCTRLA) Trigger source is TC2 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_MC_0_Val _UINT32_(0x2A)                                       /* (DMAC_CHCTRLA) Trigger source is TC2 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_MC_1_Val _UINT32_(0x2B)                                       /* (DMAC_CHCTRLA) Trigger source is TC2 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_OVF_Val _UINT32_(0x2C)                                       /* (DMAC_CHCTRLA) Trigger source is TC3 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_MC_0_Val _UINT32_(0x2D)                                       /* (DMAC_CHCTRLA) Trigger source is TC3 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC3_DMAC_ID_MC_1_Val _UINT32_(0x2E)                                       /* (DMAC_CHCTRLA) Trigger source is TC3 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_OVF_Val _UINT32_(0x2F)                                       /* (DMAC_CHCTRLA) Trigger source is TC4 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_MC_0_Val _UINT32_(0x30)                                       /* (DMAC_CHCTRLA) Trigger source is TC4 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC4_DMAC_ID_MC_1_Val _UINT32_(0x31)                                       /* (DMAC_CHCTRLA) Trigger source is TC4 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_OVF_Val _UINT32_(0x32)                                       /* (DMAC_CHCTRLA) Trigger source is TC5 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_MC_0_Val _UINT32_(0x33)                                       /* (DMAC_CHCTRLA) Trigger source is TC5 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC5_DMAC_ID_MC_1_Val _UINT32_(0x34)                                       /* (DMAC_CHCTRLA) Trigger source is TC5 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_OVF_Val _UINT32_(0x35)                                       /* (DMAC_CHCTRLA) Trigger source is TC6 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_MC_0_Val _UINT32_(0x36)                                       /* (DMAC_CHCTRLA) Trigger source is TC6 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC6_DMAC_ID_MC_1_Val _UINT32_(0x37)                                       /* (DMAC_CHCTRLA) Trigger source is TC6 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_OVF_Val _UINT32_(0x38)                                       /* (DMAC_CHCTRLA) Trigger source is TC7 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_MC_0_Val _UINT32_(0x39)                                       /* (DMAC_CHCTRLA) Trigger source is TC7 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC7_DMAC_ID_MC_1_Val _UINT32_(0x3A)                                       /* (DMAC_CHCTRLA) Trigger source is TC7 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_OVF_Val _UINT32_(0x3B)                                       /* (DMAC_CHCTRLA) Trigger source is TC8 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_MC_0_Val _UINT32_(0x3C)                                       /* (DMAC_CHCTRLA) Trigger source is TC8 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC8_DMAC_ID_MC_1_Val _UINT32_(0x3D)                                       /* (DMAC_CHCTRLA) Trigger source is TC8 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_OVF_Val _UINT32_(0x3E)                                       /* (DMAC_CHCTRLA) Trigger source is TC9 OVF  */
#define   DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_MC_0_Val _UINT32_(0x3F)                                       /* (DMAC_CHCTRLA) Trigger source is TC9 MC0  */
#define   DMAC_CHCTRLA_TRIGSRC_TC9_DMAC_ID_MC_1_Val _UINT32_(0x40)                                       /* (DMAC_CHCTRLA) Trigger source is TC9 MC1  */
#define   DMAC_CHCTRLA_TRIGSRC_QSPI_DMAC_ID_RX_Val _UINT32_(0x41)                                       /* (DMAC_CHCTRLA) Trigger source is QSPI RX  */
#define   DMAC_CHCTRLA_TRIGSRC_QSPI_DMAC_ID_TX_Val _UINT32_(0x42)                                       /* (DMAC_CHCTRLA) Trigger source is QSPI TX  */
#define DMAC_CHCTRLA_TRIGSRC_DISABLE          (DMAC_CHCTRLA_TRIGSRC_DISABLE_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Only software/event triggers Position */
#define DMAC_CHCTRLA_TRIGSRC_RTC_DMAC_ID_TIMESTAMP (DMAC_CHCTRLA_TRIGSRC_RTC_DMAC_ID_TIMESTAMP_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is RTC Position */
#define DMAC_CHCTRLA_TRIGSRC_DSU_DMAC_ID_DCC0 (DMAC_CHCTRLA_TRIGSRC_DSU_DMAC_ID_DCC0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is DSU DCC0 Position */
#define DMAC_CHCTRLA_TRIGSRC_DSU_DMAC_ID_DCC1 (DMAC_CHCTRLA_TRIGSRC_DSU_DMAC_ID_DCC1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is DSU DCC1 Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM0_DMAC_ID_RX (DMAC_CHCTRLA_TRIGSRC_SERCOM0_DMAC_ID_RX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM0 RX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM0_DMAC_ID_TX (DMAC_CHCTRLA_TRIGSRC_SERCOM0_DMAC_ID_TX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM0 TX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM1_DMAC_ID_RX (DMAC_CHCTRLA_TRIGSRC_SERCOM1_DMAC_ID_RX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM1 RX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM1_DMAC_ID_TX (DMAC_CHCTRLA_TRIGSRC_SERCOM1_DMAC_ID_TX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM1 TX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM2_DMAC_ID_RX (DMAC_CHCTRLA_TRIGSRC_SERCOM2_DMAC_ID_RX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM2 RX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM2_DMAC_ID_TX (DMAC_CHCTRLA_TRIGSRC_SERCOM2_DMAC_ID_TX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM2 TX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM3_DMAC_ID_RX (DMAC_CHCTRLA_TRIGSRC_SERCOM3_DMAC_ID_RX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM3 RX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM3_DMAC_ID_TX (DMAC_CHCTRLA_TRIGSRC_SERCOM3_DMAC_ID_TX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM3 TX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM4_DMAC_ID_RX (DMAC_CHCTRLA_TRIGSRC_SERCOM4_DMAC_ID_RX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM4 RX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM4_DMAC_ID_TX (DMAC_CHCTRLA_TRIGSRC_SERCOM4_DMAC_ID_TX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM4 TX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM5_DMAC_ID_RX (DMAC_CHCTRLA_TRIGSRC_SERCOM5_DMAC_ID_RX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM5 RX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM5_DMAC_ID_TX (DMAC_CHCTRLA_TRIGSRC_SERCOM5_DMAC_ID_TX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM5 TX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM6_DMAC_ID_RX (DMAC_CHCTRLA_TRIGSRC_SERCOM6_DMAC_ID_RX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM6 RX Position */
#define DMAC_CHCTRLA_TRIGSRC_SERCOM6_DMAC_ID_TX (DMAC_CHCTRLA_TRIGSRC_SERCOM6_DMAC_ID_TX_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is SERCOM6 TX Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_OVF (DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC0 OVF Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC0 MC0 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC0 MC1 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_2 (DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_2_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC0 MC2 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_3 (DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_3_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC0 MC3 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_4 (DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_4_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC0 MC4 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_5 (DMAC_CHCTRLA_TRIGSRC_TCC0_DMAC_ID_MC_5_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC0 MC5 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_OVF (DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC1 OVF Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC1 MC0 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC1 MC1 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_2 (DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_2_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC1 MC2 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_3 (DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_3_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC1 MC3 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_4 (DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_4_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC1 MC4 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_5 (DMAC_CHCTRLA_TRIGSRC_TCC1_DMAC_ID_MC_5_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC1 MC5 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_OVF (DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC2 OVF Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC2 MC0 Position */
#define DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TCC2_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCC2 MC1 Position */
#define DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TCO OVF Position */
#define DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC0 MC0 Position */
#define DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC0_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC0 MC1 Position */
#define DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC1 OVF Position */
#define DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC1 MC0 Position */
#define DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_MC_1 (DMAC_CHCTRLA_TRIGSRC_TC1_DMAC_ID_MC_1_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC1 MC1 Position */
#define DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_OVF  (DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_OVF_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC2 OVF Position */
#define DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_MC_0 (DMAC_CHCTRLA_TRIGSRC_TC2_DMAC_ID_MC_0_Val << DMAC_CHCTRLA_TRIGSRC_Pos) /* (DMAC_CHCTRLA) Trigger source is TC2 MC0 Position */
